import { Text, View } from "@tarojs/components";
import { useEffect } from "react";
import Taro from "@tarojs/taro";
import "./index.less";

export default function AgreementPrivate() {
  useEffect(() => {
    Taro.setNavigationBarTitle({
      title: "隐私政策",
    });
  }, []);
  return (
    <View className="content">
      <View>
        <View className="h1">在线服务用户协议</View>
        <View className="line"></View>
        <View className="h2">在线服务用户协议</View>
        <View className="line"></View>
        <View></View>
        更新时间：2023 年 7月 11日
        <View></View>
        生效时间：2023 年 7月 11日
        <View className="line"></View>
        感谢您选择海湃领客<Text className="h3">在线服务</Text>
        （“本服务”）！在您使用本服务前，了解我们提供的服务以及我们对您的期望是非常必要的，我们将尽可能使用通俗易懂的语言，全面地向您展现本协议的内容，我们也希望您花一些时间，熟悉本协议各项条款。
        《在线服务用户协议》（以下简称“本协议”）是由上海海湃领客文化科技有限公司（以下简称“海湃领客”）与您（包含注册、登录、使用、浏览海湃领客产品、服务的个人或组织）之间所订立的协议。您确认您有签订本协议的全部授权与权限。如果您代表某一实体签订本协议，您确认您已获得该实体的授权，有权代表其接受本协议，在此情形下，本协议以下提及的“您”即代表该实体。
        <View className="h2">
          我们在此善意地提醒您，本协议中与您的权益（可能）存在重大关系的条款，我们已采用字体加粗的方式来特别提醒您，请您留意重点查阅。
        </View>
        您应当在确认充分阅读本协议字体加粗条款，明确理解了该等字体加粗条款的前提下使用本服务。如果您对本协议及本服务有任何问题、疑惑，请随时联系我们，我们专门设立了
        邮箱，您可以通过发送电子邮件至该邮箱与我们联系。
        <View className="h3">
          除非您同意本协议的所有条款，否则您无权登录或使用任何海湃领客在线服务。您登录、开启以及在开启本服务状态下进行注册、登录、使用、下载等使用本服务的行为有可能在合理合法的情况下被我们视为您同意本协议全部条款，并同意受其约束，
        </View>
        包括接受海湃领客对任一服务条款随时所做的任何修改。海湃领客有权对本协议包含的条款随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，您可在本网站查阅最新版协议条款。在海湃领客修改本协议相关条款之后，若您不接受修改后的条款，请停止使用海湃领客提供的产品和服务，您继续使用海湃领客提供的产品和服务将被视为您已接受了修改后的协议。。
        <View className="h2">
          如果您因年龄、智力等因素而不具有完全民事行为能力，请在父母或其他监护人的陪同下阅读和判断是否同意本协议。
        </View>
        <View className="line"></View>
        以下术语的解释是为了您更加清晰地了解本协议的内容：
        <View></View>
        <View>
          1 <Text className="h3">“海湃领客”/“我们”</Text>
          ：是指上海海湃领客文化科技有限公司。
        </View>
        <View>
          2 <Text className="h3">“海湃领客在线服务账号”</Text>
          ：指您用于登录本服务的cemeta账号和第三方账号。cemeta账号由海湃领客提供，即您在海湃领客对应服务网站上完成注册所获得的账号。第三方账号由海湃领客之外的其他方提供，包括QQ账号、微信账号、新浪微博账号、小米账号及后续可能增加的其他账号。
        </View>
        <View>
          3 <Text className="h3">“您”或“用户”</Text>
          ：指使用本服务中的任何部分或全部的自然人用户
        </View>
        <View>
          4 <Text className="h3">“组织”</Text>
          ：指法人以及虽不具备法人资格但合法设立、有一定的财产可以承担法律责任的机构，包括但不限于政府机关、企事业单位、合伙、社会团体及其他组织用户。
        </View>
        <View>
          5 <Text className="h3">“中国大陆地区”</Text>
          ：仅为本协议之目的，指中华人民共和国范围内香港特别行政区、澳门特别行政区以及台湾地区以外的其他地区。
        </View>
        <View>
          6 <Text className="h3">“关联公司”</Text>
          ：指不时（直接或间接）控制该方，或受该方控制的公司。控制是指享有该公司50%以上的管理或决策权利（不论是通过表决权、合同或其他方式）。
        </View>
        <View className="h2">一．海湃领客在线服务</View>
        1.本服务是基于互联网技术提供的。本服务主要包括：
        后续可能推出的并纳入海湃领客在线服务范畴内的其他各项服务，具体服务以我们实际提供的为准。我们或我们的关联公司及/或与我们或我们的关联公司存在合作关系的第三方合作伙伴推出的供您以海湃领客在线服务账号登录使用的服务、产品均属于本服务。
        <View className="h2">
          2.我们可能根据实际运营情况增加、删减、替换或调整本服务的内容以及提供形式、对收费服务的服务费用的收费模式、收费标准、方式进行修改和变更，我们也可能会对由其提供的目前为免费使用的服务开始收费。前述修改、变更或开始收费前，我们将在相应服务页面进行通知或公告。
        </View>
        <View className="h2">
          3.使用本服务时会耗用您的终端设备和带宽等资源，您应自行配备软硬件以及带宽，并承担因此产生的费用，例如，软硬件购置费、带宽费用、电话费、手机短信费（如有）等。
        </View>
        <View className="h2">
          4.您充分理解并同意，本服务的反馈均产生于技术模型，我们已经努力在改善模型算法，但是由于技术发展的局限性，仍不能避免会出现事实、观点、价值等瑕疵或错漏。如果遇到令您不快或与法律法规等相冲突的情形，请您向我们反馈，我们会在核实后立刻处理，衷心感谢您为技术发展所做的贡献。同时，请您不要在本服务中输入、保存和传播任何可能有害、有误的信息，否则您将自行单独被相关机关追究法律责任，我们不因此承担任何法律责任。如果您不能接受上述风险和责任，请您立即停止使用本服务。
        </View>
        <View className="h2">
          5.您充分理解并同意，算法回答基于大数据和技术模型的反馈，并非专业人士所给予的建议、反馈，我们并不能保证相应结果的真实性、有效性和准确性。如涉及到医师、法律、金融投资相关等需取得行政许可并具有专业性的事项，请另行咨询专业人士。您充分理解并同意，算法回答可能与您实际情况或现实生活不符，仅供娱乐性质的自用，请勿在现实生活中仅依据算法回答进行决策或行动，否则可能给您或他人的人身、财产安全带来损害，您理解
          不应对相应后果承担任何责任，如果您不能进行谨慎判断，请立即停止使用本服务。
        </View>
        <View className="h2">
          6.为保护文学、艺术和科学作品作者的著作权，以及与著作权有关的权益，我们高度重视知识产权，并尽量避免侵犯他人合法权益。但是作为问答基础服务的提供者，我们每天会收到大量的用户上传的内容并进行改善我们的算法。如果您认为我们在提供服务的过程中，侵犯了您的著作权或其他合法权益，请与我们联系，并提供相应的合法权益证明资料和侵权内容凭证等，我们将第一时间安排处理并采取相应必要措施。
        </View>
        <View className="h2">
          7.对于您在使用本服务过程中提出的相同、相似或不同请求，我们可能会对不同用户提供相同的反馈结果。这些结果不视为您享有独占权益的相关事项，您无法对相关内容主张独占权利（包括但不限于著作权），即不能妨碍其他用户使用相同反馈内容，相关用户均可在不侵犯第三方合法权益的前提下，对输入、输出内容享有一定程度上的权益。
        </View>
        <View className="h2">二．账号的获得、安全、管理、注销</View>
        <View className="h2">1. 账号获得</View>
        1.1.如您通过注册cemeta账号登录本服务，则您按照注册页面提示填写信息、阅读并点击同意本协议且完成全部注册流程后，您获得的cemeta账号即是您的海湃领客在线服务账号。
        <View>
          1.2.如您通过注册或使用已有的第三方账号登录本服务，您的第三方账号即是您的海湃领客在线服务账号。
        </View>
        <View>
          1.3.您仅可自行通过我们认可的官方渠道成为本服务的注册用户或会员。
        </View>
        <View>
          1.4.如果您因年龄、智力等因素而不具有完全民事行为能力，请您在注册申请海湃领客账号及登录本服务前，取得您父母或其他监护人的指导和同意。
        </View>
        <View className="h2">2.账号安全</View>
        <View className="h2">
          2.1.海湃领客在线服务账号由您自行保管，若因为您自身行为（包括但不限于多人共享同一海湃领客在线服务账号、安装非法或来路不明的程序等），导致您的海湃领客在线服务账号、密码遭他人非法使用、攻击或您遭受诈骗等，由此产生的损失及后果，均由您自行承担。
        </View>
        我们有权根据法律规定随时要求您进行实名认证，您应当予以配合并向我们提供认证所需的相关资料，您同意授权我们可以向第三方核实您的身份和资格等信息。
        <View>
          2.3.请您在实名认证时务必谨慎对待，确保认证主体与账号使用主体保持一致，避免将本人使用的海湃领客在线服务账号认证在他人名下等任何不当认证行为。实名认证主体将被视为承诺对海湃领客在线服务账号下的一切行为负责的主体，若账号或账号下行为出现纠纷（包括但不限于实施违法违规行为、逾期支付服务费等），需由实名认证主体承担全部责任。
        </View>
        <View>
          2.4.部分第三方网站或者服务可能可以用cemeta账号作为其登录途径之一。您知晓，这些网站或者服务并非我们运营，您应自行判断此类第三方网站或者服务的安全性和可用性，并自行承担相关风险和责任。
        </View>
        <View className="h2">3.账号管理</View>
        3.1.您应保证海湃领客在线服务账号名称及您使用海湃领客在线服务账号的所有行为不违反《计算机信息网络国际联网安全保护管理办法》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》、《维护互联网安全的决定》、《互联网新闻信息服务管理规定》、《互联网用户账号名称管理规定》等相关法律规定，海湃领客在线服务账号名称及您通过海湃领客在线服务发布、传播或以其他方式传送的信息不含有下列内容：
        1） 反对宪法所确定的基本原则的； 2）
        危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 3）
        损害国家荣誉和利益的； 4） 煽动民族仇恨、民族歧视、破坏民族团结的； 5）
        破坏国家宗教政策，宣扬邪教和封建迷信的； 6）
        散布谣言，扰乱社会秩序，破坏社会稳定的； 7）
        散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 8）
        侮辱或者诽谤他人，侵害他人合法权利的； 9）
        煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；10）以非法民间组织名义活动的；11)含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感内容的；
        12）
        含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
        <View>
          3.2.
          <Text className="h3">
            您应确保您的海湃领客在线服务账号名称非为您冒用、关联机构或社会名人注册的账号名称。
          </Text>
        </View>
        <View>
          3.3.您理解并同意，您对您使用的海湃领客在线服务账号下的所有行为结果均自行负责。
        </View>
        <View>3.4.您不得有偿或无偿转让海湃领客在线服务账号。</View>
        <View className="h2">8 4. 账号注销</View>
        <View>
          4.1.您仅能申请注销您本人的海湃领客在线服务账号，并依照我们的相关流程进行注销。
        </View>
        <View>4.2.您仍应对您在注销账号前使用本服务的行为承担相应责任。</View>
        <View>
          4.3.注销成功后，账号信息、个人身份信息、文档信息、交易记录、会员权益等将无法恢复或提供。
        </View>
        <View>
          5.如您持续长时间地不登录海湃领客在线服务账号，我们有权将账号进行冻结操作，您可联系我们对账号进行解封。
        </View>
        <View className="h2">三．服务的开通</View>
        <View>
          1.本服务支持您通过海湃领客在线服务账号进行登录，您在接受本协议及本服务包含的具体服务附带的协议（如有）的全部内容后，可使用海湃领客在线服务账号接入本服务的部分或全部服务，获得本服务部分或全部服务的账户，成为本服务部分或全部服务的合法用户。
        </View>
        <View>
          2.若您以您拥有的多个海湃领客在线服务账号接入本服务的部分或全部服务，则您实际取得了本服务的部分或全部服务的服务账户，上述服务账户之间相互独立，不可进行任何信息的传递，若您或您所服务的组织为某一服务账户订购服务中的收费服务而支付服务费用，则您的其他该服务账户将无法享受您或您所服务的组织为该服务账户订购的服务中的收费服务。
        </View>
        <View>
          3.您知悉并认可，本服务所包含的诸如
          等各项子服务相互独立，您或您所服务的组织为您所拥有的海湃领客在线服务账号申请开通哪一项或哪几项的服务，则该账号仅拥有该项或者该几项服务的相关特权。
        </View>
        <View>
          4.请您知悉，您在中国大陆地区申请注册的海湃领客在线服务账号仅供您登录、使用针对中国大陆地区用户提供的本服务，您无权登录、使用我们或我们之关联公司及/或与我们或我们之关联公司存在合作关系的第三方合作伙伴针对中国大陆地区以外的用户提供的服务；反之，您在中国大陆地区以外的国家/地区申请注册、开通的服务账号，仅供您登录、使用我们或我们之关联公司及/或与我们或我们之关联公司存在合作关系的第三方合作伙伴针对中国大陆地区以外的用户提供的服务，您无权登录、使用针对中国大陆地区用户提供的本服务。我们或我们之关联公司有权通过您登录、使用本服务时显示的IP地址、设备识别码等自行判断您是否为中国大陆地区用户。
        </View>
        <View>
          5.在此请您知晓，我们虽与第三方账号提供方开展合作，但您系基于对该第三方账号提供方的信任使用该第三方账号接入本服务，该第三方账号的有效性、准确性、安全性以及可用性验证由该第三方账号提供方自行负责，因该第三方账号提供方原因导致该账号无法登录，无法使用该账号获得本服务，该第三方账号、密码或您的任何内容、信息等被泄露、盗用等，您仅可联系该第三方负责处理。
        </View>
        <View>
          6.在此请您知晓,我们不负责保管该第三方账号接入本服务时使用的您的账号资料，不提供除cemeta账号之外的第三方账号的密码找回服务。如果您的第三方账户名称或密码被遗忘、丢失或盗用，您可通过第三方账号提供方明示的帮助路径找回丢失的第三方账号资料。
        </View>
        <View>
          7.您知悉并认可，如您所拥有的海湃领客在线服务账号已开通的某一项或某几项的服务为您所服务的组织为您分配的，则您所服务的组织有权随时收回其所分配的某一或某几项服务，届时您将无法继续通过该账号使用所分配的某一或某几项服务，由此发生的争议及给您造成的损失均由您所服务的组织承担。
        </View>
        <View>
          8.您知悉并认可，因您丢失海湃领客在线服务账号，而致使无法使用您所订购的收费服务的，我们对此不承担任何责任。
        </View>
        <View>
          9.若您使用第三方账号接入本服务，而该第三方账号提供方与我们终止合作，我们将尽全部合理努力提前通知，并引导您将本服务转至您已有的其他海湃领客在线服务账号下（如有），或转至由您配合开通的其他海湃领客在线服务账号下，若您不同意上述转移，我们将为您终止本服务。因您不同意转移而致使本服务终止的，自本服务终止之日起，您将无法再继续使用本服务的任何功能，且您为获得本服务收费部分已向我们缴纳的任何服务费用（如有），我们均无退还义务。
        </View>
        <View className="h2">四．许可使用的地域范围</View>
        <View>
          任何情况下您在中国大陆地区范围外使用海湃领客在线服务账号登录并使用本服务或本服务包含的任何具体子服务的任何部分或全部均属于超出授权范围使用本服务或本服务包含的任何具体子服务的任何部分或全部的行为，因此如您超出授权范围使用本服务或本服务包含的任何具体子服务的任何部分或全部，我们对于其能否登录或正常使用本服务及本服务包含的任何具体子服务的任何部分或全部不作担保或保证。
        </View>
        <View className="h2">五．用户行为</View>
        <View className="h2">1.账号登录行为</View>
        <View>
          您知悉并认可，我们会对您在线登录使用本服务的设备数量、异地登录频次设置上限。（看是否需要）
        </View>
        <View>
          1.1.为了保证服务质量，我们建议，您通过某一海湃领客在线服务账号登录本服务的设备累计不超过5台，且同类设备累计不得多于2台；如本服务包含的任何具体子服务的任何部分或全部另有设备数量限制的，则以届时该服务具体的设备数量限制要求为准。其中，同类设备指属于同一设备类型的设备，设备类型主要包括：手机、平板电脑、笔记本电脑、台式电脑等。
        </View>
        <View>
          1.2.如您的海湃领客在线服务账号存在频繁、多次异地登录的情况，我们有权视情况冻结该账号。
        </View>
        <View className="h2">2.内容规范</View>
        <View>
          2.1.您在使用本服务时，请勿上传、提交、发布、存储、发送、接收、分享以下内容：
        </View>
        <View>
          2.1.1.有违法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的内容；
        </View>
        <View>
          2.1.2.骚扰、广告信息、过度营销信息、危害未成年人的信息及垃圾信息。
        </View>
        <View>
          2.2.对于您使用本服务，上传、提交、发布、存储、发送、接收、传播或分享的内容，我们仅在有关法律、法规、国家政策等规定或者相关国家机关的要求的前提下，自行或委托第三方进行查看、审阅、分析、讨论等，并有权将该等内容提供给相关国家机关审阅并用于其所需的目的。我们自行或委托第三方对该等内容进行查看、审阅、分析、讨论的行为，不代表我们对该等内容承担任何审查或保证责任，亦不豁免您因违反该条约定而需承担的本协议约定的违约责任。
        </View>
        <View>
          2.3.对于您通过本服务上传、提交、发布、存储、发送、接收、传播或分享的作品，我们将对合乎适用法律法规的、清晰且完整的著作权侵权指控通知做出回应。敬请注意，如果您虚假陈述任何内容或侵犯他人著作权，您将承担损害赔偿责任（包括诉讼费和律师费）。因此，如果您不确定某些材料是否对他人著作权构成侵权，我们建议您先行与专业法律顾问进行沟通。
        </View>
        <View className="h2">3.其他规范</View>
        <View>
          3.1.我们公布的注册、登录、使用本服务的方式为注册、登录、使用本服务的唯一合法方式，您通过其他任何渠道、任何途径、任何方式获取的本服务（包括且不限于账号、积分、等服务）均为非法取得，我们不承认其效力，且一经发现我们有权立即做出删除、取消、清零、封号等处理，任何因此导致的一切不利后果均由您自行承担。
        </View>
        <View>
          3.2.本服务仅供您自行使用，您在任何时候均无权以任何方式将本服务包含的任何部分或全部予以转让、出租、借用、分享、出售给他人。
        </View>
        <View>
          3.3.您不得利用海湃领客在线服务账号等服务，进行倒卖、转手、置换、抵押、有价交易等方式非法牟利，一经发现，我们有权严肃处理。
        </View>
        <View>
          3.4.本服务项下您通过免费或收费方式获得的相应服务，仅限您个人使用；其中，您通过免费方式获得的服务，仅限于个人非商业目的使用；您通过收费方式获得的服务，具体用于非商业目的或是商业目的以及商业目的的具体范围，均以购买时网站展示的授权信息为准。您不得将获得的服务内容向任何第三方或为任何第三方的利益而复制、发行、销售、出租、通过信息网络进行传播、翻译、许诺销售、提供、许可、使用或以其他形式进行使用。
        </View>
        <View>3.5.您应保证不出现如下情形：</View>
        <View>3.5.1.用作不合法目的或为推广危险活动而使用本服务；</View>
        <View>
          3.5.2.干涉或妨碍本服务或与本服务有关的服务器或网络，或不遵守任何与本服务有关或适用于本服务的网络的要求、程序、政策或规定；
        </View>
        <View>3.5.3危害未成年人的行为；</View>
        <View>
          3.5.4.
          有任何侵犯我们合法权益的行为，包括但不限于在我们举办的诸如促销、抽奖、赠送、做任务等活动中利用海湃领客在线服务账号刷取数据的作弊行为、套利行为等；
        </View>
        <View>3.5.5.侵犯任何第三方合法权益的行为；</View>
        <View>3.5.6.其他我们认为有害或不正当行为。</View>
        <View></View>
        <View className="h2">六．知识产权及相关合法权益</View>
        <View>
          1.上海海湃领客文化科技有限公司是cemeta产品及服务的知识产权和相关合法权益的权利人。本服务的一切著作权、商标权、专利权、商业秘密等知识产权及竞争性利益，以及与本服务相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应国际条约的保护，cemeta平台享有上述知识产权和相关合法权益。
        </View>
        <View>
          2.对于cemeta平台享有知识产权及相关合法权益的信息内容，未经其同意，用户不得在任何地方直接或间接进行发布、复制、传播、改编、出版等，或者用于其他任何商业目的。不得擅自对本服务中包含的任何资料（包括但不限于文本、图片、图形、音频、视频、API文档等）进行任何形式的翻录、复制或从事其他任何违反相关法律、法规的活动。针对上述侵犯知识产权和/或其它合法权益的个人和组织，cemeta平台和相关权利人将依法向其追究相应法律责任。
        </View>
        <View>
          3.您理解并承诺，您在使用本服务时发布上传的内容均由您原创或已获合法授权（且含转授权），知识产权或相关合法权益归您或合法第三方所有，同时不侵犯任何人的知识产权、名誉权、姓名权、隐私权、商业秘密等合法权益，否则由此产生的侵权风险和责任由您承担，相应纠纷应由您负责解决，并且您应赔偿我们由此遭受的全部直接、间接损失（包括但不限于经济、商誉、维权支出、律师费等损失）。同时，对于您发布上传的内容，您授予cemeta平台一项无偿、无需标注您个人身份的、在法律允许范围内合理且最大程度的权益，允许我们使用您的内容向您提供服务、改进和提升我们的服务，用来提升我们的算法服务。如果您不愿意向我们提供前述授权的，请您立即停止使用我们的服务。
        </View>
        <View>
          4.您理解并且同意，为持续改善cemeta为您提供的各项服务，除非有相反证明，您使用
          平台服务上传、发布或传输内容即代表了您有权且同意在全世界范围内，永久性的、不可撤销的、免费的授予cemeta及其关联方对该内容的存储、使用、发布、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；对您的上传、发布的内容进行商业开发的权利；通过有线或无线网络向计算机终端、移动通讯终端（包括但不限于便携式通讯设备如手机和智能平板电脑等）、手持数字影音播放设备、电视接收设备（模拟信号接收设备、数字信号接收设备、数字电视、IPTV、电视机机顶盒、视频投影仪、车载电视、互联网电视/OTT终端、智能电视等带互联网接入功能的播放设备等）、智能音响等智能硬件终端等提供信息的下载、点播、语音播放、数据传输、音频业务、移动视频业务（包括但不限于SMS、MMS、WAP、IVR、Streaming、手机视频等无线服务）及其相关宣传和推广等服务的权利；以及再授权给其他第三方以上述方式使用的权利。
        </View>
        <View className="h2">七．广告</View>
        <View>
          1.您认可我们有权通过我们的任何产品、任何页面、任何位置及/或在向您提供本服务时可展示广告，无论是针对自身产品/服务或第三方产品/服务。
        </View>
        <View>
          2.您同意，对本服务中出现的广告，您应审慎判断其真实性和可靠性，除法律明确规定外，您应对因该广告而实施的行为负责。
        </View>
        <View>
          3.您应意识到广告作为本服务一部分所展示给您的内容，可能受知识产权的保护。您不得复制、修改、发行、通过信息网络传播该内容（无论全部还是部分）或根据该内容创作衍生作品。
        </View>
        <View className="h2">八．未成年人使用</View>
        <View>
          1.我们非常注重未成年人的保护。我们希望未成年人在接受监护人指导、监督并经其同意的前提下使用本服务。
        </View>
        <View>
          2.我们依赖于监护人对未成年人行为的监督、指导及保证为未成年人提供本服务，未成年人使用本服务，以及行使和履行本协议项下的权利和义务即视为已获得了监护人的认可，因此，未成年人因使用本服务产生的一切后果将由未成年人及未成年人的监护人依照法律规定承担。
        </View>
        <View>
          3.我们提醒未成年人在使用本服务时，要善于网上学习，认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活。
        </View>
        <View className="h2">九．违约及处理</View>
        <View>1.发生如下情形之一的，视为您违约：</View>
        <View>1.1.使用本服务时违反有关法律法规规定的；</View>
        <View>1.2.侵犯我们及任何第三方合法利益的；</View>
        <View>1.3.违反本协议的任何约定。</View>
        <View>
          2.您确认并同意，如发生前述任一违约行为后，我们有权采取以下一项或多项处理措施：
        </View>
        <View>2.1.采取技术手段予以删除、屏蔽或断开相关的信息；</View>
        <View>2.2.中止或终止部分或全部本服务；</View>
        <View>
          3.我们无需向您或您所服务的组织退还任何服务费用，未使用的服务费用将作为违约金归我们所有。
        </View>
        <View>
          4.若因您的任何违约行为致使我们或其关联公司被追究责任或使我们或其关联公司利益受损的，您及/或您所服务的或组织应为我们及其关联公司提供抗辩并对我们及其关联公司进行赔偿，赔偿金额包括您因违约行为所获得的一切直接、间接利益，我们及其关联公司因此遭受的损失以及我们因此所需支付的包括但不限于诉讼费用、调查费用、律师费用、公证费用等一切合理费用。
        </View>
        <View>
          5.由此导致您或第三方遭受任何损失（包括但不限于通信中断，用户资料、邮件和虚拟财产及相关数据等的丢失、毁损、清空或相关服务无法使用等损失）我们不承担任何责任，且我们无义务为您或第三方提供任何内容恢复或备份服务；
        </View>
        <View>
          6.我们有权交由有关部门依照相关法律法规规定处理，且我们保留要求您承担相应法律责任的权利。
        </View>
        <View className="h2">十．责任限制</View>
        <View>
          1.下列任何一种情形的发生，可能会造成您的海湃领客在线服务账号无法登录或我们无法向您提供本协议项下的服务，给您带来的不便，请您谅解：
        </View>
        <View>
          1.1.定期或不定期对本服务的相关网站、服务器进行检查或施工，更新软硬件等；
        </View>
        <View>1.2.服务器遭受损坏，无法正常运作；</View>
        <View>1.3.突发性的软硬件设备与电子通信设备故障；</View>
        <View>1.4.网络提供商线路或其他故障；</View>
        <View>1.5.为维护国家安全或其他第三者之人身安全；</View>
        <View>1.6.我们对政府机构的命令或者要求的遵守；</View>
        <View>1.7.不可抗力及其他第三方原因。</View>
        <View>
          2.如您通过海湃领客在线服务账号登录、使用相关智能写作服务（具体服务内容以Web端内展示的内容为准），请您理解并同意：
        </View>
        <View>
          2.1.智能写作所提供的内容是AI自动从大量语料中学习并自动生成的，我们对生成内容的正确性和合法性不做保证，您需对其使用生成内容以及对生成内容做出的修改的结果承担相应的责任。
        </View>
        <View>
          2.2.智能写作仅为您进行中文写作所使用的工具。您使用智能写作的任何服务不应当视为您与我们之间就写作成果成立任何委托、承揽、加工等民事法律关系；
        </View>
        <View>
          2.3.智能写作根据您键入的内容自动生成相关内容，不代表我们赞成您键入的内容及修改成果的内容或立场。
        </View>
        <View>
          2.4.智能写作仅根据您键入的内容自动生成相关内容，就您使用智能写作过程中键入的内容、修改成果以及您对于修改成果做出的修改，您确认已获得任何第三方的必要和合法授权。
        </View>
        <View>
          3.您理解，本服务是按照现有技术和条件所能达到的现状提供的。我们将尽最大努力确保服务的连贯性和安全性，但我们不能保证所提供的服务毫无瑕疵。所以您也同意，即使我们提供的服务存在瑕疵，但若上述瑕疵是当时行业技术水平所无法避免的，其将不被视为我们违约，双方应友好协作共同解决问题。
        </View>
        <View>
          4.您可通过多种客户端使用本服务，但您理解并同意，因客户端兼容性不同、展示效果不同、经营策略安排或调整等原因，不同客户端的用户可使用的本服务的具体内容可能会存在差异，具体以我们实际提供的为准。
        </View>
        <View>
          5.适用法律允许的最大范围内，我们并不担保我们所提供的服务一定能满足您的要求或符合您的期望。
        </View>
        <View className="h2">十一．服务的终止</View>
        <View>
          1.当且仅当我们自行决定终止本服务中某一项或某几项单独收费服务运营的情况下，对于该等被终止的单独收费服务中您已经订购但尚未使用的部分（如有），我们将以银行转账方式或我们与您共同接受的其他方式，将剩余的服务费用退还与您。
        </View>
        <View>
          2.我们给予您30个工作日的期限用于您对前述第1款所述的已经订购但尚未使用的服务部分申请退费。您应在上述期限内，依照届时我们公布的具体政策，申请办理退费。上述申请退费期限届满，您提交的退费申请（需符合我们届时公布的具体政策）未能到达我们届时指定接受地址的，视为您自动放弃该项申请退费权利，我们有权拒绝进行退费。
        </View>
        <View>
          3.除前述情况之外的任何情况，我们均无需向您退还任何服务费用，本款约定如与本协议其他条款约定发生冲突均以本款约定为准。
        </View>
        <View className="h2">十二．协议的变更</View>
        <View>
          1.您知悉并认可，由于我们提供的服务和适用于您与我们双方的法律会发生变更，本条款及其他单项服务协议条款会不得不变更。
        </View>
        <View>
          2.如果您不同意我们修改的内容，请您在本协议和/或其他单项服务协议条款修改后（即修改后的本协议、其他单项服务协议条款载明的更新时间后）不要再使用本服务和/或其他单项服务的任何部分，一旦您在本协议和/或其他单项服务协议条款修改后出现任何使用本服务和/或其他单项服务的行为，则表明您已阅读、知悉并同意修改后的本协议和/或其他单项服务协议条款全部内容。
        </View>
        <View>
          3.除此处所述的由我们做出的变更外，对本协议和/或其他单项服务协议条款的任何其他修订或修改均无效，除非您与我们明确签署纸质书面协议另行变更本协议和/或其他单项服务协议条款。
        </View>
        <View className="h2">十三．通告</View>
        <View>
          1.所有致您的通告均可通过与本服务相关的网站公告、电子邮件、常规的站内信件或手机短信传送。其他重要事项均可以此形式进行。
        </View>
        <View>
          2.该通告于发送或公告之日视为已送达收件人。因为特殊原因（特殊原因包括但不限于：您提供的电子邮箱失效、您的邮箱设有邮件过滤、邮件拦截功能）导致您的电子邮件地址无法成功收到我们向您所提供的电子邮箱发送的通告，我们对此不承担任何责任。
        </View>
        <View className="h2">十四．其他</View>
        <View>
          1.本协议是您与我们之间关于您使用本服务所达成的法律协议，本协议生效日期以协议首部载明的日期为准，如协议中未载明生效日期的，则以上线后7日届满为生效日。与此同时，本协议自您勾选“同意”（具体措辞以页面载明的为准）后对双方产生约束力，具体时间以我们系统记录的时间为准。
        </View>
        <View>
          2.即便您没有勾选“同意”（具体措辞以页面载明的为准）本协议，下述行为也可能在合理合法的情况下被我们视为您对本协议所有条款的认可：
        </View>
        <View>2.1.点击登录本服务；</View>
        <View>2.2.实际使用本服务；</View>
        <View>
          2.3.实际使用我们连同本服务一并提供的任何产品或服务（如有）；
        </View>
        <View>
          2.4.实际使用第三方连同本服务一并提供的任何产品或服务（如有）。
        </View>
        <View>
          3.本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
        </View>
        <View>
          4.如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向北京市朝阳区人民法院提起诉讼。
        </View>
        <View>
          5.如本协议中的任何条款因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
        </View>
      </View>
    </View>
  );
}
